/***************************************************************************
 *	@ファイル名		:	lcd.h
 *	@概要		:	SPI通信にて，グラフィックディスプレイ(DOGS102-6)を制御します．
 *					~RESET	:	PB11
 *					RS		:	PB12
 *					SCK		:	PB13
 *					MOSI	:	PB15
 *	@バージョン		:	1.2.0
 *	@開発者		:	キネクト
 *	@使用環境		:	STM32F4DISCOVERY, MB_Ver2, Coocox CoIDE
 **************************************************************************/

#ifndef __LCD_H__
#define __LCD_H__

/* 定数定義	============================================================= */
#define LCD_WIDTH	102
#define LCD_HEIGHT	64

/* 関数プロトタイプ宣言	===================================================== */
/***************************************************
 * @関数名	:	LCD_Init
 * @概要		:	MB上のLCD(DOGS102N-6)を初期化します．
 * @引数		:	なし
 * @戻り値	:	なし
 ************************************************ */
void LCD_Init(void);

/***************************************************
 * @関数名		:	LCD_Send_Command
 * @概要			:	LCDに制御コマンドを送信します．
 * @引数	-buf	:	コマンド(1[Byte])
 * @戻り値		:	なし
 ************************************************ */
void LCD_Send_Command(u8 cmd);

/***************************************************
 * @関数名		:	LCD_Send_Data
 * @概要			:	LCDにデータを送信します．
 * @引数	-data	:	データ(1[Byte])
 * @戻り値		:	なし
 ************************************************ */
void LCD_Send_Data(u8 data);

/***************************************************
 * @関数名	:	LCD_Clear
 * @概要		:	LCDの表示領域をクリアします．
 * @引数		:	なし
 * @戻り値	:	なし
 ************************************************ */
void LCD_Clear(void);

/***************************************************
 * @関数名	:	LCD_LocateChar
 * @概要		:	LCDの文字指定座標を変更します．
 * @引数	-x	:	指定X座標
 * 		-y	:	指定Y座標
 * @戻り値	:	なし
 ************************************************ */
void LCD_LocateChar(int x, int y);

/***************************************************
 * @関数名	:	LCD_DrawDot
 * @概要		:	LCDに1ピクセルの点を描画します．
 * @引数	-x	:	指定X座標
 * 		-y	:	指定Y座標
 * @戻り値	:	なし
 ************************************************ */
void LCD_DrawDot(int x, int y);

/***************************************************
 * @関数名			:	LCD_DrawChar
 * @概要				:	LCDに1バイト文字を表示します．
 * @引数	-AsciiCode	:	ASCIIコードでの文字を指定．
 * @戻り値			:	なし
 ************************************************ */
void LCD_DrawChar(char AsciiCode);

/***************************************************
 * @関数名		:	LCD_ScrollPixel
 * @概要			:	LCDを指定ピクセルだけ縦にスクロールします．
 * @引数	-num	:	スクロールするピクセル数
 * @戻り値		:	なし
 ************************************************ */
void LCD_ScrollPixel(u8 num);

#endif /* __LCD_H__ */
